Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: To do this, you can figure out which key you want by running `gpg --list-keys`:
cs: Pomocí příkazu `gpg --list-keys` můžete určit, jaký klíč chcete:

source: To exit the script and reject the push, exit non-zero.
cs: Chcete-li skript ukončit a odesílaná data odmítnout, návratová hodnota musí být nenulová.

source: To follow along, you first need to create a new local Subversion repository:
cs: Chcete-li postupovat podle mě, budete si nejprve muset vytvořit nový lokální repozitář Subversion:

source: To get a list of the author names that SVN uses, you can run this:
cs: Chcete-li získat seznam jmen autorů používaných v SVN, spusťte tento příkaz:

source: To get it running without having to reboot, you can run this:
cs: Pokud nechcete počítač restartovat, spusťte tento příkaz:

source: To get the project, run
cs: Můžete ho získat spuštěním

source: To get the raw commit data, you can use another plumbing command called `git cat-file`.
cs: Chcete-li získat syrová data revizí, můžete použít další nízkoúrovňový příkaz: `git cat-file`.

source: To get them, you must reset your branch to where `master` is now:
cs: Chcete-li je získat, musíte vaši větev resetovat do místa, kde se nyní nachází větev `master`:

source: To merge this work into your current working branch, you can run `git merge origin/serverfix`.
cs: Chcete-li začlenit tato data do své aktuální pracovní větve, můžete provést příkaz `git merge origin/serverfix`.

source: To modify a commit that is farther back in your history, you must move to more complex tools.
cs: Chcete-li změnit revizi, která leží hlouběji ve vaší historii, budete muset sáhnout po složitějších nástrojích.

source: To my wife Jessica who has supported me for all of these years and to my daughter Josephine, who will support me when I'm too old to know what's going on.
cs: Mé ženě Jessice, která mě po celé ty roky podporovala, a mé dceři Josephine, která mě bude podporovat, až budu příliš starý na to, abych věděl, co se děje kolem.

source: To phrase that another way, when you try to merge one commit with a commit that can be reached by following the first commit's history, Git simplifies things by moving the pointer forward because there is no divergent work to merge together – this is called a ``fast-forward.''
cs: Jinými slovy, pokud se snažíte sloučit jeden objekt revize s jiným, na který se můžete dostat přes historii prvního objektu revize, Git to vše zjednoduší tím, že přesune ukazatel vpřed, protože neexistuje žádná odchylující se práce, s kterou bychom to museli slučovat. Tomuto postupu se říká „rychle vpřed“ („fast-forward“).

source: To pull the `master` branch on the remote down to `origin/mymaster` locally, you can run
cs: Chcete-li stáhnout větev `master` ze vzdáleného serveru do lokálního adresáře `origin/mymaster`, můžete zadat příkaz:

source: To push to a Subversion server, you run the `git svn dcommit` command:
cs: Pro odeslání revizí na server Subversion zadejte příkaz `git svn dcommit`:

source: To really understand the way Git does branching, we need to take a step back and examine how Git stores its data.
cs: Abychom skutečně pochopili, jak v Gitu funguje větvení, musíme poodstoupit a podívat se, jak Git ukládá data.

source: To remove a file named passwords.txt from your entire history, you can use the `--tree-filter` option to `filter-branch`:
cs: Pro odstranění souboru s názvem passwords.txt z celé historie můžete použít parametr `--tree-filter`, který přidáte k příkazu `filter-branch`:

source: To remove it, you can run `git stash drop` with the name of the stash to remove:
cs: Chcete-li ji odstranit, spusťte příkaz `git stash drop` s názvem odkladu, který má být odstraněn:

source: To remove remote branches, you must remove the ref files from the server manually.
cs: Budete-li chtít odstranit vzdálenou větev, budete muset ručně smazat referenční soubory ze serveru.

source: To run `filter-branch` on all your branches, you can pass `--all` to the command.
cs: Chcete-li spustit příkaz `filter-branch` na všech větvích, zadejte k příkazu parametr `--all`.

source: To see a full diff of what would happen if you were to merge this topic branch with another branch, you may have to use a weird trick to get the correct results.
cs: Chcete-li vidět plný výpis diff, jak by vypadaly rozdíly, kdybyste tuto tématickou větev začlenili do jiné větve, můžete použít speciální trik, který vám zobrazí požadované informace.

source: To see all the branches that contain work you haven't yet merged in, you can run `git branch --no-merged`:
cs: Pro zobrazení všech větví, které obsahují dosud nezačleněnou práci, spusťte příkaz `git branch --no-merged`:

source: To see reflog information formatted like the `git log` output, you can run `git log -g`:
cs: Chcete-li zobrazit informace záznamu reflog ve formátu výstupu `git log`, zadejte příkaz `git log -g`:

source: To see the diff of what you’ve staged, you can use the `6` or `d` (for diff) command.
cs: Chcete-li zobrazit výpis diff připravených souborů, použijte příkaz `6` nebo `d` (jako „diff“).

source: To see the last commit on each branch, you can run `git branch -v`:
cs: Chcete-li zobrazit poslední revizi na každé větvi, spusťte příkaz `git branch -v`:

source: To see the same information in a much more useful way, we can run `git log -g`, which will give you a normal log output for your reflog.
cs: Chcete-li zobrazit stejné informace v užitečnějším formátu, můžete spustit příkaz `git log -g`, jímž získáte normální výstup příkazu log pro reflog.

source: To see what changes each commit introduces, remember that you can pass the `-p` option to `git log` and it will append the diff introduced to each commit.
cs: Chcete-li zjistit, jaké změny byly v jednotlivých revizích provedeny, můžete k příkazu `git log` přidat parametr `-p`, který ke každé revizi připojí rozdíly ve formátu diff.

source: To see what happens, you can manually ask Git to pack up the objects by calling the `git gc` command:
cs: Chcete-li vidět, jak proces probíhá, můžete systému Git ručně zadat, aby objekty zabalil. Zadejte příkaz `git gc`:

source: To see what packfiles are available on this server, you need to get the `objects/info/packs` file, which contains a listing of them (also generated by `update-server-info`):
cs: Chcete-li zjistit, jaké balíčkové soubory jsou na serveru dostupné, pomůže vám soubor `objects/info/packs`, který obsahuje jejich seznam (rovněž generován příkazem `update-server-info`):

source: To see what you've changed but not yet staged, type `git diff` with no other arguments:
cs: Pokud chcete vidět, co jste změnili, ale zatím nepřipravili k zapsání, napište `git diff` bez dalších parametrů:

source: To see which branches are already merged into the branch you're on, you can run `git branch --merged`:
cs: Chcete-li zjistit, které větve už byly začleněny do větve, na níž se nacházíte, spusťte příkaz `git branch --merged`:

source: To see which remote servers you have configured, you can run the `git remote` command.(((git commands, remote))) It lists the shortnames of each remote handle you've specified.
cs: Chcete-li zjistit, jaké vzdálené servery jste si nakonfigurovali, můžete použít příkaz `git remote`.(((git příkazy, remote))) Zobrazí se seznam krátkých jmen, která jste vzdáleným repozitářům přidělili.

source: To see which stashes you’ve stored, you can use `git stash list`:
cs: Chcete-li se podívat, které soubory jste odložili, spusťte příkaz `git stash list`:

source: To set up a local branch with a different name than the remote branch, you can easily use the first version with a different local branch name:
cs: Chcete-li nastavit lokální větev s jiným názvem, než má vzdálená větev, můžete jednoduše použít první variantu s odlišným názvem lokální větve:

source: To set up your client, you must export the P4PORT environment variable to point to the Perforce depot:
cs: K nastavení svého klienta budete muset exportovat proměnnou prostředí P4PORT, která bude ukazovat na depot Perforce:

source: To stage it, you run the `git add` command.
cs: K zapsání ho připravíme provedením příkazu `git add`.

source: To stage the TODO and index.html files, you can type the numbers:
cs: Jestliže chcete připravit k zapsání soubory TODO a index.html, zadejte příslušná čísla:

source: To stay out of trouble, try to follow these guidelines:
cs: Chcete-li se vyhnout problémům, dodržujte tato pravidla:

source: To synchronize your work, you run a `git fetch origin` command.
cs: K synchronizaci své práce použijte příkaz `git fetch origin`.

source: To tag that commit, you specify the commit checksum (or part of it) at the end of the command:
cs: Pro označkování revize zadejte na konec příkazu kontrolní součet revize (nebo jeho část):

source: To tell Git to treat all `pbxproj` files as binary data, add the following line to your `.gitattributes` file:
cs: Chcete-li systému Git zadat, aby nakládal se všemi soubory `pbxproj` jako s binárními daty, vložte do souboru `.gitattributes` následující řádek:

source: To tell Git to use it as the default message that appears in your editor when you run `git commit`, set the `commit.template` configuration value:
cs: Chcete-li systému Git zadat, aby soubor používal jako výchozí zprávu, která se zobrazí v textovém editoru po spuštění příkazu `git commit`, nastavte konfigurační hodnotu `commit.template`:

source: To verify a signed tag, you use `git tag -v [tag-name]`.
cs: Chcete-li ověřit podepsanou značku, použijte příkaz `git tag -v [název značky]`.

source: To visualize this, let's assume that you have a directory containing three files, and you stage them all and commit.
cs: Pro ilustraci předpokládejme, že máte adresář s třemi soubory, které připravíte k zapsání a následně zapíšete.

source: Tracked files are files that were in the last snapshot; they can be unmodified, modified, or staged.
cs: Sledované soubory jsou ty soubory, které byly součástí posledního snímku. Mohou být ve stavu nezměněn (unmodified), změněn (modified) nebo připraven k zapsání (staged).

source: Tracking branches are local branches that have a direct relationship to a remote branch.
cs: Sledující větve jsou lokální větve s přímým vztahem ke vzdálené větvi.

source: Type
cs: Zadejme tedy:

source: Typically people use this functionality to mark release points (v1.0, and so on).
cs: Tato funkce se nejčastěji používá k označení jednotlivých vydání (například v1.0 atd.).

source: Typing `?` shows a list of what you can do:
cs: Zadáte-li znak `?`, zobrazí se seznam možností, které máte k dispozici.

source: Understanding and mastering this feature gives you a powerful and unique tool and can entirely change the way that you develop.
cs: Pochopení a zvládnutí tohoto rysu vám dává do rukou výkonný a jedinečný nástroj a může zcela změnit způsob, jakým budete realizovat vývoj.

source: Unlike many other VCSs, Git encourages workflows that branch and merge often, even multiple times in a day.
cs: Na rozdíl od ostatních systémů pro správu verzí vybízí Git ke způsobu práce, kdy se větvení a slučování provádí často, dokonce i několikrát za den.

source: Untracked basically means that Git sees a file you didn't have in the previous snapshot (commit); Git won't start including it in your commit snapshots until you explicitly tell it to do so.
cs: Není-li soubor sledován, znamená to, že Git vidí soubor, který nebyl v předchozím snímku (commit). Git ho nezařadí ani do dalších snímků, dokud mu k tomu nedáte výslovný příkaz.

source: Untracked files are everything else – any files in your working directory that were not in your last snapshot and are not in your staging area.
cs: Nesledované soubory jsou všechny ostatní, tedy veškeré soubory ve vašem pracovním adresáři, které nebyly obsaženy ve vašem posledním snímku a nenacházejí se v oblasti připravených změn.

source: Using a VCS also generally means that if you screw things up or lose files, you can easily recover.
cs: Používáte-li systém pro správu verzí a něco se pokazí, nebo přijdete o soubory, můžete se z toho snadno dostat.

source: Using attributes, you can do things like specify separate merge strategies for individual files or directories in your project, tell Git how to diff non-text files, or have Git filter content before you check it into or out of Git.
cs: Pomocí atributů lze například určit odlišnou strategii slučování pro konkrétní soubory nebo adresáře projektu, zadat systému Git nástroj diff pro netextové soubory nebo jak filtrovat obsah před načtením dat do systému Git nebo jejich odesláním.

source: Using submodules isn’t without hiccups, however.
cs: Používání submodulů se však vždy neobejde bez zádrhelů.

source: Various integration managers are in charge of certain parts of the repository; they're called lieutenants.
cs: Za konkrétní části repozitáře odpovídají různí integrační manažeři. Říká se jim poručíci (lieutenants).

source: Version control is a system that records changes to a file or set of files over time so that you can recall specific versions later.
cs: Správa verzí je systém, který zaznamenává změny souboru nebo sady souborů v čase tak, abyste se mohli později k určité verzi vrátit.

source: We can also see that our `master` branch is tracking `origin/master` and is up to date.
cs: Vidíme také, že naše větev `master` sleduje `origin/master` a její stav je aktuální.

source: We can demonstrate by aliasing `git visual` to run `gitk`:
cs: Můžeme si to předvést vytvořením aliasu `git visual` pro spuštění `gitk`:

source: We may additionally have permission to push to one or more of these, though we can't tell that here.
cs: Na jeden nebo několik z nich můžeme mít navíc přiděleno právo pro odesílání změn (push), ale z tohoto výpisu to nelze poznat.

source: We will begin by explaining some background on version control tools, then move on to how to get Git running on your system and finally how to get it set up to start working with.
cs: Nejdříve si vysvětlíme něco o původu nástrojů pro správu verzí, poté se budeme věnovat tomu, jak spustit systém Git ve vašem počítači, a nakonec se podíváme na to, co musíme nastavit, abychom s ním mohli začít pracovat.

source: We will go into more detail about the various possible workflows for your Git project in <<_distributed_git>>, so before you decide which branching scheme your next project will use, be sure to read that chapter.
cs: Další detaily různých možných pracovních postupů, které můžete pro váš projekt v Gitu využít, rozebereme v kapitole <<_distributed_git>>. Takže než se rozhodnete, jaké schéma větvení bude váš příští projekt využívat, přečtěte si ji.

source: We won't refer to them or assume you've used them later in the book, but you should probably know how to use them.
cs: V dalších částech knihy se na ně nebudeme odkazovat, ani nebudeme předpokládat, že je umíte používat, ale asi byste o nich měli vědět.

source: We'll also show you how to set up Git to ignore certain files and file patterns, how to undo mistakes quickly and easily, how to browse the history of your project and view changes between commits, and how to push and pull from remote repositories.
cs: Ukážeme si také, jak nastavit Git, aby ignoroval určité soubory a masky souborů, jak rychle a jednoduše vrátit nežádoucí změny, jak procházet historii projektu a zobrazit změny mezi jednotlivými revizemi a jak posílat soubory do vzdálených repozitářů (push) a naopak z nich soubory zase stahovat (pull).

source: We'll cover aspects of each of these in a series of use cases, moving from simple to more complex; you should be able to construct the specific workflows you need in practice from these examples.
cs: Každou z těchto otázek si probereme na sérii praktických případů, postupně od jednodušších po složitější. Z uvedených příkladů byste si měli být schopni odvodit vlastní pracovní postup, který budete v praxi využívat.

source: We'll cover this distinction a bit more in <<_distributed_git>>.
cs: Uvedený rozdíl si blíže vysvětlíme v kapitole <<_distributed_git>>.

source: We'll discuss how to export a bare repository copy for this purpose in <<_git_on_the_server>>.
cs: O exportu kopie holého repozitáře pro tento účel se více dočtete v části <<_git_on_the_server>>.

source: We'll explore some of the benefits you gain by thinking of your data this way when we cover Git branching in <<_git_branching>>.
cs: Některými výhodami, které získáme při tomto uvažování o datech, se budeme zabývat při výkladu větvení v kapitole <<_git_branching>>.

source: We'll go into much more detail about what `reset` does and how to master it to do really interesting things in <<_git_reset>>.
cs: Podrobněji se budeme tím, co příkaz `reset` dělá a jak jej využít pro opravdu zajímavé věci, v podkapitole <<_git_reset>>.

source: We'll go over the strengths and possible weaknesses of each design; you can choose a single one to use, or you can mix and match features from each.
cs: Uvedeme si jejich přednosti i eventuální slabiny. Můžete vybrat jeden z nich, nebo je můžete pro dosažení požadovaných vlastností navzájem kombinovat.

source: We'll go over this syntax in detail in <<_commit_ranges>>.
cs: Podrobně se budeme touto syntaxí zabývat v části <<_commit_ranges>>.

source: We'll go over what these commands do in just a minute.
cs: K tomu, co přesně tyto příkazy provedou, se dostaneme za okamžik.

source: We'll use the normal path here because doing so is almost always faster.
cs: My zde budeme používat normální cestu, protože je to téměř vždy rychlejší.

source: We've covered basic branching and merging in Git.
cs: V této kapitole jsme se věnovali základům větvení a slučování.

source: We've mentioned and given some demonstrations of adding remote repositories in previous sections, but here is how to do it explicitly.(((git commands, remote))) To add a new remote Git repository as a shortname you can reference easily, run `git remote add [shortname] [url]`:
cs: O přidávání vzdálených repozitářů jsme se zmínili v předchozích podkapitolách a něco jsme si i ukázali, ale tady si přesně řekneme, jak to udělat.(((git příkazy, remote))) Chcete-li přidat nový vzdálený repozitář Git a zadat zkrácený název, přes který se můžete snadno odkazovat, spusťte příkaz `git remote add [zkrácený název] [url]`:

source: Welcome to the second edition of Pro Git.
cs: Vítejte u druhého vydání knihy Pro Git.

source: Well, doing so creates a new pointer for you to move around.
cs: Znamená to vytvoření nového ukazatele, s nímž můžete pohybovat.

source: Well, let's do another commit:
cs: Dobře, zapišme další revizi:

source: What does that mean?
cs: A co to znamená?

source: What if you realize that you don't want to keep your changes to the `CONTRIBUTING.md` file?
cs: A co když zjistíte, že nechcete zachovat změny, které jste provedli v souboru `CONTRIBUTING.md`?

source: What is the significance of that?
cs: A jaký to má význam?

source: What the heck?
cs: Co to má být?

source: What then?
cs: Co teď?

source: What used to be referenced at `pb/master` is now at `paul/master`.
cs: Z původní reference `pb/master` se tak nyní stává `paul/master`.

source: When Git packs objects, it looks for files that are named and sized similarly, and stores just the deltas from one version of the file to the next.
cs: Při balení objektů vyhledá Git soubory, které mají podobný název a podobnou velikost, a uloží pouze rozdíly mezi jednotlivými verzemi souboru.

source: When I originally sat down to write the book nearly five years ago (it took me a while to get the first version out), I had just started working at a very little known company developing a Git hosting website called GitHub.
cs: Když jsem před téměř pěti lety usedal k psaní této knihy (chvíli mi trvalo, než první verze spatřila světlo světa), začal jsem zrovna pracovat v téměř neznámé společnosti, která začala vyvíjet webový server pro hostování Gitu, zvaný GitHub.

source: When I wrote the first edition, Git was still a relatively difficult to use and barely adopted tool for the harder core hacker.
cs: V době psaní prvního vydání byl Git ještě nástrojem poměrně obtížně použitelným a sotva přijímaným i z pohledu skalních vývojářů.

source: When Scott asked if I'd be interested in working on the second edition, I didn't even have to think.
cs: Když se mě Scott zeptal, jestli bych měl zájem spolupracovat na druhém vydání, nemusel jsem o tom ani přemýšlet.

source: When all the patches for your topic are applied and committed into your branch, you can choose whether and how to integrate them into a longer-running branch.
cs: Až budete mít všechny záplaty aplikovány a zapsány do tématické větve, můžete se rozhodnout, zda a jak je chcete integrovat do některé z trvalejších větví.

source: When that is set up, you can use `git imap-send` to place the patch series in the Drafts folder of the specified IMAP server:
cs: Až toto nastavení dokončíte, můžete použít příkaz `git imap-send`, jímž umístíte sérii záplat (patch) do složky Koncepty (Drafts) zadaného serveru IMAP:

source: When you `dcommit`, you see output like this:
cs: Výstup příkazu `dcommit` bude nyní vypadat následovně:

source: When you clone a repository, it generally automatically creates a `master` branch that tracks `origin/master`.
cs: Pokud klonujete repozitář, většinou se vytvoří větev `master`, která bude sledovat větev `origin/master`.

source: When you commit, you see something like this:
cs: Jestliže zapíšete revizi, zobrazí se přibližně toto:

source: When you create the commit by running `git commit`, Git checksums each subdirectory (in this case, just the root project directory) and stores those tree objects in the Git repository.
cs: Když příkazem `git commit` vytváříte revizi, vypočítá Git kontrolní součet každého podadresáře (v tomto případě pouze kořenového adresáře projektu) a uloží tyto objekty stromu (tree) do repozitáře Gitu.

source: When you design these filters, they should be able to fail gracefully and have the project still work properly.
cs: Při navrhování těchto filtrů byste tedy měli myslet i na to, aby projekt pracoval správně, i když filtr selže.

source: When you do actions in Git, nearly all of them only add data to the Git database.
cs: Pokud v Gitu provádíte nějaké akce, pak téměř všechny z nich data do databáze pouze přidávají.

source: When you first clone a repository, all of your files will be tracked and unmodified because you just checked them out and haven't edited anything.
cs: Po úvodním klonování repozitáře budou všechny vaše soubory sledované a nezměněné, protože jste je právě získali a dosud jste neudělali žádné změny.

source: When you have all the necessary dependencies, you can go ahead and grab the latest tagged release tarball from several places.
cs: Po doinstalování všech potřebných závislostí můžete pokračovat stažením nejnovějšího archivu z několika míst.

source: When you have work in a topic branch and have determined that you want to integrate it, you move to that branch and run the rebase command to rebuild the changes on top of your current master (or `develop`, and so on) branch.
cs: Máte-li určitou práci v tématické větvi a rozhodli jste se, že ji integrujete, přejdete na tuto větev a spustíte příkaz rebase, jímž znovu sestavíte příslušné změny na vrcholu svojí aktuální hlavní větve (příp. větve `develop` apod.).
